src/Documents/Перечисления/Перечисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Перечисления</name>
  <registerRecords>AccumulationRegister.РН_МестаНакопленияДенег</registerRecords>
  <attributes>
    <name>ИсточникДС_Получатель</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ИсточникДС_Отправитель</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.Семья</types>
    </type>
  </attributes>
  <attributes>
    <name>Получатель</name>
    <type>
      <types>CatalogRef.КонтрагентМесто</types>
      <types>CatalogRef.ФизЛица</types>
      <types>String</types>
      <types>CatalogRef.Семья</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Document>

src/AccumulationRegisters/РН_МестаНакопленияДенег/РН_МестаНакопленияДенег.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>РН_МестаНакопленияДенег</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Основание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>МестоХраненияДС</name>
    <type>
      <types>CatalogRef.ИсточникХраненияДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ОтКогоКомуКуда</name>
    <type>
      <types>CatalogRef.КонтрагентМесто</types>
      <types>CatalogRef.ФизЛица</types>
      <types>String</types>
      <types>CatalogRef.Люди</types>
      <types>CatalogRef.Семья</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

src/Documents/Перечисления/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.РН_МестаНакопленияДенег.Записывать = Истина;
	Движение = Движения.РН_МестаНакопленияДенег.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.МестоХраненияДС = ИсточникДС_Получатель;
	//Движение.Пользователь = Отправитель;
	Движение.ОтКогоКомуКуда = Получатель;
	Движение.Сумма = Сумма;
	Движение.Основание = Основание;

	// регистр РН_МестаНакопленияДенег Расход
	Движения.РН_МестаНакопленияДенег.Записывать = Истина;
	Движение = Движения.РН_МестаНакопленияДенег.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	Движение.Период = Дата;
	Движение.МестоХраненияДС = ИсточникДС_Отправитель;
	//Движение.Пользователь = Отправитель;
	Движение.ОтКогоКомуКуда = Получатель;
	Движение.Сумма = Сумма;
	Движение.Основание = Основание;
КонецПроцедуры
